# JOINs y Vistas
### Reto 1: Subconsultas

Usando la base de datos tienda, escribe consultas que permitan responder las siguientes preguntas.

In [3]:
%%sql
USE tienda;

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

1. ¿Cuál es el nombre de los empleados cuyo sueldo es menor a $10,000?

In [3]:
%%sql
SELECT nombre
    FROM empleado
    WHERE id_puesto IN (SELECT id_puesto 
                            FROM puesto
                            WHERE salario < 10000);

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

2. ¿Cuál es la cantidad mínima y máxima de ventas de cada empleado?

In [4]:
%%sql 
SELECT clave, id_empleado, count(*) ventas
      FROM venta
      GROUP BY clave, id_empleado;
SELECT id_empleado, MIN(ventas) 'Min ventas', MAX(ventas) 'Max ventas'
    FROM(SELECT clave, id_empleado, count(*) ventas
             FROM venta
             GROUP BY clave, id_empleado) as subquery
    GROUP BY id_empleado
    ORDER BY id_empleado
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
978 rows affected.
10 rows affected.

[(2, 1, 1),
 (3, 1, 1),
 (4, 1, 1),
 (5, 1, 1),
 (6, 1, 1),
 (12, 1, 1),
 (15, 1, 2),
 (18, 1, 1),
 (22, 1, 1),
 (23, 1, 1)]

3. ¿Cuáles claves de venta incluyen artículos cuyos precios son mayores a $5,000?

In [5]:
%%sql
SELECT clave
    FROM venta
    WHERE id_articulo IN (SELECT id_articulo
                              FROM articulo 
                              WHERE precio > 5000)
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('60760-353',),
 ('52380-1865',),
 ('64239-303',),
 ('0049-0032',),
 ('68151-1610',),
 ('52343-028',),
 ('60760-353',),
 ('23359-017',),
 ('59535-3501',),
 ('13107-062',)]

### Reto 2: JOINs
Usando la base de datos tienda, escribe consultas que permitan responder las siguientes preguntas.
1. ¿Cuál es el nombre de los empleados que realizaron cada venta?

In [6]:
%%sql
SELECT e.nombre, v.id_venta
    FROM venta v
    JOIN empleado e
        ON v.id_empleado = e.id_empleado
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('Morey', 177),
 ('Morey', 564),
 ('Jeannette', 817),
 ('Jeannette', 939),
 ('Cassey', 243),
 ('Gnni', 652),
 ('Lisle', 143),
 ('Lisle', 435),
 ('Crissie', 31),
 ('Crissie', 160)]

2. ¿Cuál es el nombre de los artículos que se han vendido?

In [7]:
%%sql
SELECT a.nombre, v.id_venta
    FROM venta v
    JOIN articulo a
        ON v.id_articulo = a.id_articulo
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('Pasta - Angel Hair', 919),
 ('Soup Campbells - Tomato Bisque', 885),
 ('Wine - Valpolicella Masi', 473),
 ('Wine - Valpolicella Masi', 504),
 ('Wine - Fontanafredda Barolo', 387),
 ('Wine - Vovray Sec Domaine Huet', 629),
 ('Cake - Pancake', 845),
 ('Chocolate Liqueur - Godet White', 288),
 ('Appetizer - Southwestern', 144),
 ('Appetizer - Southwestern', 674)]

3. ¿Cuál es el total de cada venta?

In [8]:
%%sql
SELECT v.clave venta, round(sum(a.precio),2) total
    FROM venta v
    JOIN articulo a
        ON v.id_articulo = a.id_articulo
    GROUP BY v.clave
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('0228-3661', 3714.37),
 ('52125-277', 340582.65),
 ('0049-0032', 321524.61),
 ('13107-062', 249071.46),
 ('47335-894', 223650.32),
 ('51655-951', 190821.21),
 ('52380-1865', 162361.13),
 ('69128-001', 174310.76),
 ('52343-028', 150970.75),
 ('68040-706', 131078.51)]

### Reto 3: Definición de vistas
Usando la base de datos tienda, define las siguientes vistas que permitan obtener la siguiente información.
1. Obtener el puesto de un empleado.

In [22]:
%%sql
CREATE VIEW puesto097 AS
    (SELECT e.nombre empleado, p.nombre puesto
            FROM empleado e
            JOIN puesto p
                ON e.id_puesto = p.id_puesto);

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

In [24]:
%%sql
SELECT * 
    FROM puesto097
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('Enrichetta', 'Product Engineer'),
 ('Morey', 'Budget/Accounting Analyst IV'),
 ('Jeannette', 'Occupational Therapist'),
 ('Cassey', 'Financial Advisor'),
 ('Gnni', 'Physical Therapy Assistant'),
 ('Lisle', 'Marketing Assistant'),
 ('Andre', 'Tax Accountant'),
 ('Land', 'Product Engineer'),
 ('Nikki', 'Sales Associate'),
 ('Aldridge', 'Structural Engineer')]

2. Saber qué artículos ha vendido cada empleado.

In [25]:
%%sql
CREATE VIEW articulo_vendedor_097 AS
    (SELECT v.clave, a.nombre articulo, e.nombre 'vendido por'
        FROM venta v
        JOIN articulo a
            ON a.id_articulo = v.id_articulo
        JOIN empleado e
            ON e.id_empleado = v.id_empleado);

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

In [26]:
%%sql
SELECT *
    FROM articulo_vendedor_097
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('0228-3661', 'Cake - Cake Sheet Macaroon', 'Arlana'),
 ('52125-277', 'Beans - Long, Chinese', 'Julianna'),
 ('0049-0032', 'Beef - Rib Roast, Capless', 'Maryellen'),
 ('52125-277', 'Langers - Ruby Red Grapfruit', 'Cad'),
 ('13107-062', 'Filter - Coffee', 'Michaeline'),
 ('0049-0032', 'Corn Meal', 'Courtnay'),
 ('47335-894', 'Wine - White, Pelee Island', 'Giuditta'),
 ('52125-277', 'Bagelers - Cinn / Brown', 'Julianna'),
 ('0049-0032', 'Smoked Tongue', 'Rosalinde'),
 ('13107-062', 'Sage Ground Wiberg', 'Ema')]

3. Saber qué puesto ha tenido más ventas.

In [27]:
%%sql
CREATE VIEW ventas_puesto_097 AS
    (SELECT p.nombre, count(v.clave) ventas
        FROM empleado e
        JOIN venta v
            ON e.id_empleado = v.id_empleado
        JOIN puesto p
            ON p.id_puesto = e.id_puesto
        GROUP BY p.nombre
        ORDER BY ventas DESC);

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

In [29]:
%%sql
SELECT *
    FROM ventas_puesto_097
    LIMIT 1;

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[('Physical Therapy Assistant', 23)]